qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/hal_lld.h
#define RCC_CFGR1_STOPKERWUCK_FIELD(n)      ((n) << RCC_CFGR1_STOPKERWUCK_Pos)
#define RCC_CFGR1_STOPKERWUCK_MSIK          RCC_CFGR1_STOPKERWUCK_FIELD(0U)
#define RCC_CFGR1_STOPKERWUCK_HSI16         RCC_CFGR1_STOPKERWUCK_FIELD(1U)

#define RCC_CFGR1_MCO1SEL_FIELD(n)          ((n) << RCC_CFGR1_MCOSEL_Pos)
#define RCC_CFGR1_MCO1SEL_OFF               RCC_CFGR1_MCO1SEL_FIELD(0U)
#define RCC_CFGR1_MCO1SEL_SYSCLK            RCC_CFGR1_MCO1SEL_FIELD(1U)
#define RCC_CFGR1_MCO1SEL_MSIS              RCC_CFGR1_MCO1SEL_FIELD(2U)
#define RCC_CFGR1_MCO1SEL_HSI16             RCC_CFGR1_MCO1SEL_FIELD(3U)
#define RCC_CFGR1_MCO1SEL_HSE               RCC_CFGR1_MCO1SEL_FIELD(4U)
#define RCC_CFGR1_MCO1SEL_LSI               RCC_CFGR1_MCO1SEL_FIELD(5U)
#define RCC_CFGR1_MCO1SEL_LSE               RCC_CFGR1_MCO1SEL_FIELD(6U)
#define RCC_CFGR1_MCO1SEL_HSI48             RCC_CFGR1_MCO1SEL_FIELD(7U)
#define RCC_CFGR1_MCO1SEL_MSIK              RCC_CFGR1_MCO1SEL_FIELD(8U)

#define RCC_CFGR1_MCO1PRE_FIELD(n)          ((n) << RCC_CFGR1_MCOPRE_Pos)
#define RCC_CFGR1_MCO1PRE_DIV1              RCC_CFGR1_MCO1PRE_FIELD(0U)
#define RCC_CFGR1_MCO1PRE_DIV2              RCC_CFGR1_MCO1PRE_FIELD(1U)
#define RCC_CFGR1_MCO1PRE_DIV4              RCC_CFGR1_MCO1PRE_FIELD(2U)
#define RCC_CFGR1_MCO1PRE_DIV8              RCC_CFGR1_MCO1PRE_FIELD(3U)
#define RCC_CFGR1_MCO1PRE_DIV16             RCC_CFGR1_MCO1PRE_FIELD(4U)
#define RCC_CFGR1_MCO1PRE_DIV32             RCC_CFGR1_MCO1PRE_FIELD(5U)
#define RCC_CFGR1_MCO1PRE_DIV64             RCC_CFGR1_MCO1PRE_FIELD(6U)
#define RCC_CFGR1_MCO1PRE_DIV128            RCC_CFGR1_MCO1PRE_FIELD(7U)

#define RCC_CFGR1_MCO2SEL_FIELD(n)          ((n) << RCC_CFGR1_MCO2SEL_Pos)
#define RCC_CFGR1_MCO2SEL_OFF               RCC_CFGR1_MCO2SEL_FIELD(0U)
#define RCC_CFGR1_MCO2SEL_SYSCLK            RCC_CFGR1_MCO2SEL_FIELD(1U)
#define RCC_CFGR1_MCO2SEL_MSIS              RCC_CFGR1_MCO2SEL_FIELD(2U)
#define RCC_CFGR1_MCO2SEL_HSI16             RCC_CFGR1_MCO2SEL_FIELD(3U)
#define RCC_CFGR1_MCO2SEL_HSE               RCC_CFGR1_MCO2SEL_FIELD(4U)
#define RCC_CFGR1_MCO2SEL_LSI               RCC_CFGR1_MCO2SEL_FIELD(5U)
#define RCC_CFGR1_MCO2SEL_LSE               RCC_CFGR1_MCO2SEL_FIELD(6U)
#define RCC_CFGR1_MCO2SEL_HSI48             RCC_CFGR1_MCO2SEL_FIELD(7U)
#define RCC_CFGR1_MCO2SEL_MSIK              RCC_CFGR1_MCO2SEL_FIELD(8U)

#define RCC_CFGR1_MCO2PRE_FIELD(n)          ((n) << RCC_CFGR1_MCO2PRE_Pos)
#define RCC_CFGR1_MCO2PRE_DIV1              RCC_CFGR1_MCO2PRE_FIELD(0U)
#define RCC_CFGR1_MCO2PRE_DIV2              RCC_CFGR1_MCO2PRE_FIELD(1U)
#define RCC_CFGR1_MCO2PRE_DIV4              RCC_CFGR1_MCO2PRE_FIELD(2U)
#define RCC_CFGR1_MCO2PRE_DIV8              RCC_CFGR1_MCO2PRE_FIELD(3U)
#define RCC_CFGR1_MCO2PRE_DIV16             RCC_CFGR1_MCO2PRE_FIELD(4U)
#define RCC_CFGR1_MCO2PRE_DIV32             RCC_CFGR1_MCO2PRE_FIELD(5U)
#define RCC_CFGR1_MCO2PRE_DIV64             RCC_CFGR1_MCO2PRE_FIELD(6U)
#define RCC_CFGR1_MCO2PRE_DIV128            RCC_CFGR1_MCO2PRE_FIELD(7U)
/** @} */

/**
 * @name    RCC_CFGR2 register helpers
 * @{
 */
#if !defined(RCC_CFGR2_HPRE_FIELD)
#define RCC_CFGR2_HPRE_FIELD(n)             ((n) << RCC_CFGR2_HPRE_Pos)
#endif
#if !defined(RCC_CFGR2_HPRE_DIV1)
#define RCC_CFGR2_HPRE_DIV1                 RCC_CFGR2_HPRE_FIELD(0U)
#define RCC_CFGR2_HPRE_DIV2                 RCC_CFGR2_HPRE_FIELD(8U)
#define RCC_CFGR2_HPRE_DIV4                 RCC_CFGR2_HPRE_FIELD(9U)
#define RCC_CFGR2_HPRE_DIV8                 RCC_CFGR2_HPRE_FIELD(10U)
#define RCC_CFGR2_HPRE_DIV16                RCC_CFGR2_HPRE_FIELD(11U)
#define RCC_CFGR2_HPRE_DIV64                RCC_CFGR2_HPRE_FIELD(12U)
#define RCC_CFGR2_HPRE_DIV128               RCC_CFGR2_HPRE_FIELD(13U)
#define RCC_CFGR2_HPRE_DIV256               RCC_CFGR2_HPRE_FIELD(14U)
#define RCC_CFGR2_HPRE_DIV512               RCC_CFGR2_HPRE_FIELD(15U)
#endif
#define STM32_HPRE_MASK                     RCC_CFGR2_HPRE_Msk
#define STM32_HPRE_POS                      RCC_CFGR2_HPRE_Pos

#if !defined(RCC_CFGR2_PPRE1_FIELD)
#define RCC_CFGR2_PPRE1_FIELD(n)            ((n) << RCC_CFGR2_PPRE1_Pos)
#endif
#if !defined(RCC_CFGR2_PPRE1_DIV1)
#define RCC_CFGR2_PPRE1_DIV1                RCC_CFGR2_PPRE1_FIELD(0U)
#define RCC_CFGR2_PPRE1_DIV2                RCC_CFGR2_PPRE1_FIELD(4U)
#define RCC_CFGR2_PPRE1_DIV4                RCC_CFGR2_PPRE1_FIELD(5U)
#define RCC_CFGR2_PPRE1_DIV8                RCC_CFGR2_PPRE1_FIELD(6U)
#define RCC_CFGR2_PPRE1_DIV16               RCC_CFGR2_PPRE1_FIELD(7U)
#endif
#define STM32_PPRE1_MASK                    RCC_CFGR2_PPRE1_Msk
#define STM32_PPRE1_POS                     RCC_CFGR2_PPRE1_Pos

#if !defined(RCC_CFGR2_PPRE2_FIELD)
#define RCC_CFGR2_PPRE2_FIELD(n)            ((n) << RCC_CFGR2_PPRE2_Pos)
#endif
#if !defined(RCC_CFGR2_PPRE2_DIV1)
#define RCC_CFGR2_PPRE2_DIV1                RCC_CFGR2_PPRE2_FIELD(0U)
#define RCC_CFGR2_PPRE2_DIV2                RCC_CFGR2_PPRE2_FIELD(4U)
#define RCC_CFGR2_PPRE2_DIV4                RCC_CFGR2_PPRE2_FIELD(5U)
#define RCC_CFGR2_PPRE2_DIV8                RCC_CFGR2_PPRE2_FIELD(6U)
#define RCC_CFGR2_PPRE2_DIV16               RCC_CFGR2_PPRE2_FIELD(7U)
#endif
#define STM32_PPRE2_MASK                    RCC_CFGR2_PPRE2_Msk
#define STM32_PPRE2_POS                     RCC_CFGR2_PPRE2_Pos
/** @} */

/**
 * @name    RCC_CFGR3 register helpers
 * @{
 */
#if !defined(RCC_CFGR3_PPRE3_FIELD)
#define RCC_CFGR3_PPRE3_FIELD(n)            ((n) << RCC_CFGR3_PPRE3_Pos)
#endif
#if !defined(RCC_CFGR3_PPRE3_DIV1)
#define RCC_CFGR3_PPRE3_DIV1                RCC_CFGR3_PPRE3_FIELD(0U)
#define RCC_CFGR3_PPRE3_DIV2                RCC_CFGR3_PPRE3_FIELD(4U)
#define RCC_CFGR3_PPRE3_DIV4                RCC_CFGR3_PPRE3_FIELD(5U)
#define RCC_CFGR3_PPRE3_DIV8                RCC_CFGR3_PPRE3_FIELD(6U)
#define RCC_CFGR3_PPRE3_DIV16               RCC_CFGR3_PPRE3_FIELD(7U)
#endif
#define STM32_PPRE3_MASK                    RCC_CFGR3_PPRE3_Msk
#define STM32_PPRE3_POS                     RCC_CFGR3_PPRE3_Pos
/** @} */

/**
 * @name    RCC_CFGR4 register helpers
 * @{
 */
#define RCC_CFGR4_BOOSTSEL_FIELD(n)         ((n) << RCC_CFGR4_BOOSTSEL_Pos)
#define RCC_CFGR4_BOOSTSEL_NOCLOCK          RCC_CFGR4_BOOSTSEL_FIELD(0U)
#define RCC_CFGR4_BOOSTSEL_MSIS             RCC_CFGR4_BOOSTSEL_FIELD(1U)
#define RCC_CFGR4_BOOSTSEL_HSI16            RCC_CFGR4_BOOSTSEL_FIELD(2U)
#define RCC_CFGR4_BOOSTSEL_HSE              RCC_CFGR4_BOOSTSEL_FIELD(3U)

#define RCC_CFGR4_BOOSTDIV_FIELD(n)         ((n) << RCC_CFGR4_BOOSTDIV_Pos)
#define RCC_CFGR4_BOOSTDIV_DIV1             RCC_CFGR4_BOOSTDIV_FIELD(0U)
#define RCC_CFGR4_BOOSTDIV_DIV2             RCC_CFGR4_BOOSTDIV_FIELD(1U)
#define RCC_CFGR4_BOOSTDIV_DIV4             RCC_CFGR4_BOOSTDIV_FIELD(2U)
#define RCC_CFGR4_BOOSTDIV_DIV6             RCC_CFGR4_BOOSTDIV_FIELD(3U)
#define RCC_CFGR4_BOOSTDIV_DIV8             RCC_CFGR4_BOOSTDIV_FIELD(4U)
#define RCC_CFGR4_BOOSTDIV_DIV10            RCC_CFGR4_BOOSTDIV_FIELD(5U)
#define RCC_CFGR4_BOOSTDIV_DIV12            RCC_CFGR4_BOOSTDIV_FIELD(6U)
#define RCC_CFGR4_BOOSTDIV_DIV14            RCC_CFGR4_BOOSTDIV_FIELD(7U)
#define RCC_CFGR4_BOOSTDIV_DIV16            RCC_CFGR4_BOOSTDIV_FIELD(8U)
/** @} */

/**
 * @name    RCC_CCIPR1 register helpers
 * @{
 */
#define RCC_CCIPR1_USART1SEL_FIELD(n)       ((n) << RCC_CCIPR1_USART1SEL_Pos)
#define RCC_CCIPR1_USART1SEL_PCLK2          RCC_CCIPR1_USART1SEL_FIELD(0U)
#define RCC_CCIPR1_USART1SEL_HSI16          RCC_CCIPR1_USART1SEL_FIELD(1U)

#define RCC_CCIPR1_USART3SEL_FIELD(n)       ((n) << RCC_CCIPR1_USART3SEL_Pos)
#define RCC_CCIPR1_USART3SEL_PCLK1          RCC_CCIPR1_USART3SEL_FIELD(0U)
#define RCC_CCIPR1_USART3SEL_HSI16          RCC_CCIPR1_USART3SEL_FIELD(1U)

#define RCC_CCIPR1_UART4SEL_FIELD(n)        ((n) << RCC_CCIPR1_UART4SEL_Pos)
#define RCC_CCIPR1_UART4SEL_PCLK1           RCC_CCIPR1_UART4SEL_FIELD(0U)
#define RCC_CCIPR1_UART4SEL_HSI16           RCC_CCIPR1_UART4SEL_FIELD(1U)

#define RCC_CCIPR1_UART5SEL_FIELD(n)        ((n) << RCC_CCIPR1_UART5SEL_Pos)
#define RCC_CCIPR1_UART5SEL_PCLK1           RCC_CCIPR1_UART5SEL_FIELD(0U)
#define RCC_CCIPR1_UART5SEL_HSI16           RCC_CCIPR1_UART5SEL_FIELD(1U)

#define RCC_CCIPR1_I3C1SEL_FIELD(n)         ((n) << RCC_CCIPR1_I3C1SEL_Pos)
#define RCC_CCIPR1_I3C1SEL_PCLK1            RCC_CCIPR1_I3C1SEL_FIELD(0U)
#define RCC_CCIPR1_I3C1SEL_MSIK             RCC_CCIPR1_I3C1SEL_FIELD(1U)

#define RCC_CCIPR1_I2C1SEL_FIELD(n)         ((n) << RCC_CCIPR1_I2C1SEL_Pos)
#define RCC_CCIPR1_I2C1SEL_PCLK1            RCC_CCIPR1_I2C1SEL_FIELD(0U)
#define RCC_CCIPR1_I2C1SEL_MSIK             RCC_CCIPR1_I2C1SEL_FIELD(1U)

#define RCC_CCIPR1_I2C2SEL_FIELD(n)         ((n) << RCC_CCIPR1_I2C2SEL_Pos)
#define RCC_CCIPR1_I2C2SEL_PCLK1            RCC_CCIPR1_I2C2SEL_FIELD(0U)
#define RCC_CCIPR1_I2C2SEL_MSIK             RCC_CCIPR1_I2C2SEL_FIELD(1U)

#define RCC_CCIPR1_I3C2SEL_FIELD(n)         ((n) << RCC_CCIPR1_I3C2SEL_Pos)
#define RCC_CCIPR1_I3C2SEL_PCLK2            RCC_CCIPR1_I3C2SEL_FIELD(0U)
#define RCC_CCIPR1_I3C2SEL_MSIK             RCC_CCIPR1_I3C2SEL_FIELD(1U)

#define RCC_CCIPR1_SPI2SEL_FIELD(n)         ((n) << RCC_CCIPR1_SPI2SEL_Pos)
#define RCC_CCIPR1_SPI2SEL_PCLK1            RCC_CCIPR1_SPI2SEL_FIELD(0U)
#define RCC_CCIPR1_SPI2SEL_MSIK             RCC_CCIPR1_SPI2SEL_FIELD(1U)

