qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/hal_lld.h
#define RCC_CCIPR1_LPTIM2SEL_FIELD(n)       ((n) << RCC_CCIPR1_LPTIM2SEL_Pos)
#define RCC_CCIPR1_LPTIM2SEL_PCLK1          RCC_CCIPR1_LPTIM2SEL_FIELD(0U)
#define RCC_CCIPR1_LPTIM2SEL_LSI            RCC_CCIPR1_LPTIM2SEL_FIELD(1U)
#define RCC_CCIPR1_LPTIM2SEL_HSI16          RCC_CCIPR1_LPTIM2SEL_FIELD(2U)
#define RCC_CCIPR1_LPTIM2SEL_LSE            RCC_CCIPR1_LPTIM2SEL_FIELD(3U)

#define RCC_CCIPR1_SPI1SEL_FIELD(n)         ((n) << RCC_CCIPR1_SPI1SEL_Pos)
#define RCC_CCIPR1_SPI1SEL_PCLK2            RCC_CCIPR1_SPI1SEL_FIELD(0U)
#define RCC_CCIPR1_SPI1SEL_MSIK             RCC_CCIPR1_SPI1SEL_FIELD(1U)

#define RCC_CCIPR1_SYSTICKSEL_FIELD(n)      ((n) << RCC_CCIPR1_SYSTICKSEL_Pos)
#define RCC_CCIPR1_SYSTICKSEL_HCLKDIV8      RCC_CCIPR1_SYSTICKSEL_FIELD(0U)
#define RCC_CCIPR1_SYSTICKSEL_LSI           RCC_CCIPR1_SYSTICKSEL_FIELD(1U)
#define RCC_CCIPR1_SYSTICKSEL_LSE           RCC_CCIPR1_SYSTICKSEL_FIELD(2U)

#define RCC_CCIPR1_FDCAN1SEL_FIELD(n)       ((n) << RCC_CCIPR1_FDCAN1SEL_Pos)
#define RCC_CCIPR1_FDCAN1SEL_IGNORE         0xFFFFFFFFU
#define RCC_CCIPR1_FDCAN1SEL_SYSCLK         RCC_CCIPR1_FDCAN1SEL_FIELD(0U)
#define RCC_CCIPR1_FDCAN1SEL_MSIK           RCC_CCIPR1_FDCAN1SEL_FIELD(1U)

#define RCC_CCIPR1_ICLKSEL_FIELD(n)         ((n) << RCC_CCIPR1_ICLKSEL_Pos)
#define RCC_CCIPR1_ICLKSEL_HSI48            RCC_CCIPR1_ICLKSEL_FIELD(0U)
#define RCC_CCIPR1_ICLKSEL_MSIK             RCC_CCIPR1_ICLKSEL_FIELD(1U)
#define RCC_CCIPR1_ICLKSEL_HSE              RCC_CCIPR1_ICLKSEL_FIELD(2U)
#define RCC_CCIPR1_ICLKSEL_SYSCLK           RCC_CCIPR1_ICLKSEL_FIELD(3U)

#define RCC_CCIPR1_USB1SEL_FIELD(n)         ((n) << RCC_CCIPR1_USB1SEL_Pos)
#define RCC_CCIPR1_USB1SEL_ICLK             RCC_CCIPR1_USB1SEL_FIELD(0U)
#define RCC_CCIPR1_USB1SEL_ICLKDIV2         RCC_CCIPR1_USB1SEL_FIELD(1U)

#define RCC_CCIPR1_TIMICSEL_FIELD(n)        ((n) << RCC_CCIPR1_TIMICSEL_Pos)
#define RCC_CCIPR1_TIMICSEL_NOCLOCK         RCC_CCIPR1_TIMICSEL_FIELD(0U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4   RCC_CCIPR1_TIMICSEL_FIELD(4U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4   RCC_CCIPR1_TIMICSEL_FIELD(5U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4   RCC_CCIPR1_TIMICSEL_FIELD(6U)
#define RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4   RCC_CCIPR1_TIMICSEL_FIELD(7U)
/** @} */

/**
 * @name    RCC_CCIPR2 register helpers
 * @{
 */
#define RCC_CCIPR2_ADF1SEL_FIELD(n)         ((n) << RCC_CCIPR2_ADF1SEL_Pos)
#define RCC_CCIPR2_ADF1SEL_HCLK             RCC_CCIPR2_ADF1SEL_FIELD(0U)
#define RCC_CCIPR2_ADF1SEL_AUDIOCLK         RCC_CCIPR2_ADF1SEL_FIELD(1U)
#define RCC_CCIPR2_ADF1SEL_HSE              RCC_CCIPR2_ADF1SEL_FIELD(2U)
#define RCC_CCIPR2_ADF1SEL_SAI1             RCC_CCIPR2_ADF1SEL_FIELD(3U)

#define RCC_CCIPR2_SPI3SEL_FIELD(n)         ((n) << RCC_CCIPR2_SPI3SEL_Pos)
#define RCC_CCIPR2_SPI3SEL_PCLK1            RCC_CCIPR2_SPI3SEL_FIELD(0U)
#define RCC_CCIPR2_SPI3SEL_MSIK             RCC_CCIPR2_SPI3SEL_FIELD(1U)

#define RCC_CCIPR2_SAI1SEL_FIELD(n)         ((n) << RCC_CCIPR2_SAI1SEL_Pos)
#define RCC_CCIPR2_SAI1SEL_MSIK             RCC_CCIPR2_SAI1SEL_FIELD(0U)
#define RCC_CCIPR2_SAI1SEL_AUDIOCLK         RCC_CCIPR2_SAI1SEL_FIELD(1U)
#define RCC_CCIPR2_SAI1SEL_HSE              RCC_CCIPR2_SAI1SEL_FIELD(2U)

#define RCC_CCIPR2_RNGSEL_FIELD(n)          ((n) << RCC_CCIPR2_RNGSEL_Pos)
#define RCC_CCIPR2_RNGSEL_IGNORE            0xFFFFFFFFU
#define RCC_CCIPR2_RNGSEL_HSI48             RCC_CCIPR2_RNGSEL_FIELD(0U)
#define RCC_CCIPR2_RNGSEL_MSIK              RCC_CCIPR2_RNGSEL_FIELD(1U)

#define RCC_CCIPR2_ADCDACPRE_FIELD(n)       ((n) << RCC_CCIPR2_ADCDACPRE_Pos)
#define RCC_CCIPR2_ADCDACPRE_ICLK           RCC_CCIPR2_ADCDACPRE_FIELD(0U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV2       RCC_CCIPR2_ADCDACPRE_FIELD(1U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV4       RCC_CCIPR2_ADCDACPRE_FIELD(8U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV8       RCC_CCIPR2_ADCDACPRE_FIELD(9U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV16      RCC_CCIPR2_ADCDACPRE_FIELD(10U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV32      RCC_CCIPR2_ADCDACPRE_FIELD(11U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV64      RCC_CCIPR2_ADCDACPRE_FIELD(12U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV128     RCC_CCIPR2_ADCDACPRE_FIELD(13U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV256     RCC_CCIPR2_ADCDACPRE_FIELD(14U)
#define RCC_CCIPR2_ADCDACPRE_ICLKDIV512     RCC_CCIPR2_ADCDACPRE_FIELD(15U)

#define RCC_CCIPR2_ADCDACSEL_FIELD(n)       ((n) << RCC_CCIPR2_ADCDACSEL_Pos)
#define RCC_CCIPR2_ADCDACSEL_HCLK           RCC_CCIPR2_ADCDACSEL_FIELD(0U)
#define RCC_CCIPR2_ADCDACSEL_HSE            RCC_CCIPR2_ADCDACSEL_FIELD(1U)
#define RCC_CCIPR2_ADCDACSEL_MSIK           RCC_CCIPR2_ADCDACSEL_FIELD(2U)

#define RCC_CCIPR2_DAC1SHSEL_FIELD(n)       ((n) << RCC_CCIPR2_DAC1SHSEL_Pos)
#define RCC_CCIPR2_DAC1SHSEL_IGNORE         0xFFFFFFFFU
#define RCC_CCIPR2_DAC1SHSEL_LSE            RCC_CCIPR2_DAC1SHSEL_FIELD(0U)
#define RCC_CCIPR2_DAC1SHSEL_LSI            RCC_CCIPR2_DAC1SHSEL_FIELD(1U)

#define RCC_CCIPR2_OCTOSPISEL_FIELD(n)      ((n) << RCC_CCIPR2_OCTOSPISEL_Pos)
#define RCC_CCIPR2_OCTOSPISEL_SYSCLK        RCC_CCIPR2_OCTOSPISEL_FIELD(0U)
#define RCC_CCIPR2_OCTOSPISEL_MSIK          RCC_CCIPR2_OCTOSPISEL_FIELD(1U)
/** @} */

/**
 * @name    RCC_CCIPR3 register helpers
 * @{
 */
#define RCC_CCIPR3_LPUART1SEL_FIELD(n)      ((n) << RCC_CCIPR3_LPUART1SEL_Pos)
#define RCC_CCIPR3_LPUART1SEL_PCLK3         RCC_CCIPR3_LPUART1SEL_FIELD(0U)
#define RCC_CCIPR3_LPUART1SEL_HSI16         RCC_CCIPR3_LPUART1SEL_FIELD(1U)
#define RCC_CCIPR3_LPUART1SEL_LSE           RCC_CCIPR3_LPUART1SEL_FIELD(2U)
#define RCC_CCIPR3_LPUART1SEL_MSIK          RCC_CCIPR3_LPUART1SEL_FIELD(3U)

#define RCC_CCIPR3_I2C3SEL_FIELD(n)         ((n) << RCC_CCIPR3_I2C3SEL_Pos)
#define RCC_CCIPR3_I2C3SEL_PCLK3            RCC_CCIPR3_I2C3SEL_FIELD(0U)
#define RCC_CCIPR3_I2C3SEL_MSIK             RCC_CCIPR3_I2C3SEL_FIELD(1U)

#define RCC_CCIPR3_LPTIM34SEL_FIELD(n)      ((n) << RCC_CCIPR3_LPTIM34SEL_Pos)
#define RCC_CCIPR3_LPTIM34SEL_MSIK          RCC_CCIPR3_LPTIM34SEL_FIELD(0U)
#define RCC_CCIPR3_LPTIM34SEL_LSI           RCC_CCIPR3_LPTIM34SEL_FIELD(1U)
#define RCC_CCIPR3_LPTIM34SEL_HSI16         RCC_CCIPR3_LPTIM34SEL_FIELD(2U)
#define RCC_CCIPR3_LPTIM34SEL_LSE           RCC_CCIPR3_LPTIM34SEL_FIELD(3U)

#define RCC_CCIPR3_LPTIM1SEL_FIELD(n)       ((n) << RCC_CCIPR3_LPTIM1SEL_Pos)
#define RCC_CCIPR3_LPTIM1SEL_MSIK           RCC_CCIPR3_LPTIM1SEL_FIELD(0U)
#define RCC_CCIPR3_LPTIM1SEL_LSI            RCC_CCIPR3_LPTIM1SEL_FIELD(1U)
#define RCC_CCIPR3_LPTIM1SEL_HSI16          RCC_CCIPR3_LPTIM1SEL_FIELD(2U)
#define RCC_CCIPR3_LPTIM1SEL_LSE            RCC_CCIPR3_LPTIM1SEL_FIELD(3U)
/** @} */

/**
 * @name    RCC_BDCR register helpers
 * @{
 */
#define RCC_BDCR_RTCSEL_FIELD(n)            ((n) << RCC_BDCR_RTCSEL_Pos)
#define RCC_BDCR_RTCSEL_NOCLOCK             RCC_BDCR_RTCSEL_FIELD(0U)
#define RCC_BDCR_RTCSEL_LSE                 RCC_BDCR_RTCSEL_FIELD(1U)
#define RCC_BDCR_RTCSEL_LSI                 RCC_BDCR_RTCSEL_FIELD(2U)
#define RCC_BDCR_RTCSEL_HSEDIV              RCC_BDCR_RTCSEL_FIELD(3U)

#define RCC_BDCR_LSCOSEL_NOCLOCK            0U
#define RCC_BDCR_LSCOSEL_LSI                (RCC_BDCR_LSCOEN)
#define RCC_BDCR_LSCOSEL_LSE                (RCC_BDCR_LSCOEN | RCC_BDCR_LSCOSEL)
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(STM32_NO_INIT) || defined(__DOXYGEN__)
#define STM32_NO_INIT                       FALSE
#endif

/**
 * @brief   External audio clock frequency.
 */
#if !defined(STM32_AUDIOCLK) || defined(__DOXYGEN__)
#define STM32_AUDIOCLK                      0U
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_CR3) || defined(__DOXYGEN__)
#define STM32_PWR_CR3                       (PWR_CR3_FSTEN | PWR_CR3_REGSEL)
#endif

/**
 * @brief   PWR CR3 register initialization value.
 */
#if !defined(STM32_PWR_SVMCR) || defined(__DOXYGEN__)
#define STM32_PWR_SVMCR                     (PWR_SVMCR_ASV | PWR_SVMCR_USV | PWR_SVMCR_AVM1EN | PWR_SVMCR_AVM2EN | PWR_SVMCR_UVMEN)
#endif

/**
 * @brief   PWR WUCR1 register initialization value.
 */
#if !defined(STM32_PWR_WUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR1                     (0U)
#endif

/**
 * @brief   PWR WUCR2 register initialization value.
 */
#if !defined(STM32_PWR_WUCR2) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR2                     (0U)
#endif

/**
 * @brief   PWR WUCR3 register initialization value.
 */
#if !defined(STM32_PWR_WUCR3) || defined(__DOXYGEN__)
#define STM32_PWR_WUCR3                     (0U)
#endif

/**
 * @brief   PWR BDCR register initialization value.
 */
#if !defined(STM32_PWR_BDCR) || defined(__DOXYGEN__)
#define STM32_PWR_BDCR                      (0U)
#endif

/**
 * @brief   PWR SECCFGR register initialization value.
 */
#if !defined(STM32_PWR_SECCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_SECCFGR                   (0U)
#endif

/**
 * @brief   PWR PRIVCFGR register initialization value.
 */
#if !defined(STM32_PWR_PRIVCFGR) || defined(__DOXYGEN__)
#define STM32_PWR_PRIVCFGR                  (0U)
#endif

/**
 * @brief   PWR APCR register initialization value.
 */
#if !defined(STM32_PWR_APCR) || defined(__DOXYGEN__)
#define STM32_PWR_APCR                      (0U)
#endif

/**
 * @brief   PWR PUCRA register initialization value.
 */
#if !defined(STM32_PWR_PUCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRA                     (0U)
#endif

/**
 * @brief   PWR PDCRA register initialization value.
 */
#if !defined(STM32_PWR_PDCRA) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRA                     (0U)
#endif

/**
 * @brief   PWR PUCRB register initialization value.
 */
#if !defined(STM32_PWR_PUCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRB                     (0U)
#endif

/**
 * @brief   PWR PDCRB register initialization value.
 */
#if !defined(STM32_PWR_PDCRB) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRB                     (0U)
#endif

/**
 * @brief   PWR PUCRC register initialization value.
 */
#if !defined(STM32_PWR_PUCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRC                     (0U)
#endif

/**
 * @brief   PWR PDCRC register initialization value.
 */
#if !defined(STM32_PWR_PDCRC) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRC                     (0U)
#endif

/**
 * @brief   PWR PUCRD register initialization value.
 */
#if !defined(STM32_PWR_PUCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRD                     (0U)
#endif

/**
 * @brief   PWR PDCRD register initialization value.
 */
#if !defined(STM32_PWR_PDCRD) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRD                     (0U)
#endif

/**
 * @brief   PWR PUCRE register initialization value.
 */
#if !defined(STM32_PWR_PUCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRE                     (0U)
#endif

/**
 * @brief   PWR PDCRE register initialization value.
 */
#if !defined(STM32_PWR_PDCRE) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRE                     (0U)
#endif

/**
 * @brief   PWR PUCRG register initialization value.
 */
#if !defined(STM32_PWR_PUCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRG                     (0U)
#endif

/**
 * @brief   PWR PDCRG register initialization value.
 */
#if !defined(STM32_PWR_PDCRG) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRG                     (0U)
#endif

/**
 * @brief   PWR PUCRH register initialization value.
 */
#if !defined(STM32_PWR_PUCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PUCRH                     (0U)
#endif

/**
 * @brief   PWR PDCRH register initialization value.
 */
#if !defined(STM32_PWR_PDCRH) || defined(__DOXYGEN__)
#define STM32_PWR_PDCRH                     (0U)
#endif

/**
 * @brief   PWR I3CPUCR1 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR1) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR1                  (0U)
#endif

/**
 * @brief   PWR I3CPUCR2 register initialization value.
 */
#if !defined(STM32_PWR_I3CPUCR2) || defined(__DOXYGEN__)
#define STM32_PWR_I3CPUCR2                  (0U)
#endif

/**
 * @brief   FLASH ACR register initialization value.
 * @note    Do not specify the LATENCY bits because those are calculated
 *          depending on other settings and ORed to this value.
 */
#if !defined(STM32_FLASH_ACR) || defined(__DOXYGEN__)
#define STM32_FLASH_ACR                     (FLASH_ACR_PRFTEN)
#endif

/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

